[Extractions par exclusions avec une formule Python dans Excel](https://www.youtube.com/watch?v=ucKD-K1N2C4&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=24)

Date : 10/06/2025

In [1]:
import pandas as pd

In [5]:
tb = pd.read_excel('data/Mask.xlsx', sheet_name='Feuil1')
tb.head().transpose()

                      0         1          2         3         4
Identifiant           1         2          3         4         5
Nom                Noix  Océrosse      Onète    Orange     Remor
Prénom         Stéphane  Séverine      Marie      Jude      Yves
Civilité       Monsieur    Madame     Madame  Monsieur  Monsieur
Salaire            3010      3299       4109      4181      4160
Ville        Montélimar    Toulon  Perpignan  Bordeaux    Nantes

Critères des employés à exclure

In [6]:
cr1 = 2000
cr2 = 2500
cr3 = 'Monsieur'

Liste des employées avec un salaire compris entre 2 000 € et 2 500 €

In [10]:
tb.mask(
    (tb['Salaire'] < cr1) |
    (tb['Salaire'] > cr2) |
    (tb['Civilité'] == cr3)
).dropna().sort_values(by=['Salaire'], ascending=True
                        ).reset_index(drop=True).transpose()

                       0          1         2
Identifiant         10.0        9.0       7.0
Nom                Sille   Sarbaque    Rouana
Prénom             Lucie       Anne     Marie
Civilité          Madame     Madame    Madame
Salaire           2136.0     2211.0    2380.0
Ville        La Rochelle  Marseille  Clermont